<?php

return [
    'users' => [
        'wallet'    => [
            'add_balance'   => 'اضافة رصيد',
            'withdraw_balance'   => 'خصم رصيد',
            'recharge_balance'  => 'شحن رصيد',
            'cashback'      => 'كاش باك',
            'order'         => 'طلب الكتروني',

            'add_balance_desc'   => 'تم اضافة رصيد الي محفظتك نتيجة :type بمبلغ :balance صالحة للاستخدام في طلباتك القادمة.',
            'withdraw_balance_desc'   => 'تم خصم رصيد من محفظتك بقيمة :balance نتيجة لتفعيل استخدام المحفظة في طلبك السابق رقم #:order .',
        ],
        'updated'   => 'تم تحديث البيانات بنجاح',
        'validation'    => [
            'current_password'  => [
                'required'  => 'ادخل كلمة المرور الحالية',
            ],
            'email'             => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'            => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'              => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'captcha'              => [
                'required'  => 'الرجاء إدخال كلمة التحقق',
                'captcha'  => 'يرجى التحقق من إدخال كلمة التحقق، حاول مرة أخرى!',
            ],
            'password'          => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من 8 مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
        ],
    ],
];
